---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.#ctor
source: html/e6d6cec7-141f-57f0-b365-efd9d05de697.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.#ctor Method

Constructs a new ExportLinetypeTable with default values.

## Syntax (C#)
```csharp
public ExportLinetypeTable()
```